In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv(r'car_df.csv')

In [4]:
df

,Name,Transimission_Type,Engine_Size,Usage_Origin,Year,Price
0,Volvo S60,Automatic,1500 CC,Kenyan Used,2016,"KES 1,699,999"
1,Toyota Landcruiser Prado,Automatic,2700 CC,Kenyan Used,2017,"KES 5,799,999"
2,Mazda CX3,Automatic,2000 CC,Foreign Used,2017,"KES 2,499,999"
3,Toyota Cami,Automatic,1300 CC,Kenyan Used,2004,"KES 579,999"
4,BMW X1,Automatic,2000 CC,Foreign Used,2017,"KES 3,799,999"
...,...,...,...,...,...,...
2635,Toyota Auris,Automatic,1500 CC,Foreign Used,2016,"KES 1,800,000"
2636,Peugeot 207,Automatic,1600 CC,Kenyan Used,2012,"KES 950,000"
2637,Mazda Atenza,Automatic,2200 CC,Foreign Used,2016,"KES 2,150,000"
2638,Isuzu Elf Light Truck,Automatic,Foreign Used,Foreign Used,2014,"KES 1,850,000"
2639,Jaguar XJ,Automatic,2000 CC,Foreign Used,2014,"KES 4,100,000"

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2640 entries, 0 to 2639
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Name                2640 non-null   object
 1   Transimission_Type  2640 non-null   object
 2   Engine_Size         2640 non-null   object
 3   Usage_Origin        2640 non-null   object
 4   Year                2640 non-null   int64
 5   Price               2640 non-null   object
dtypes: int64(1), object(5)
memory usage: 123.9+ KB

## Null

In [7]:
df.isnull().sum()

Name                  0
Transimission_Type    0
Engine_Size           0
Usage_Origin          0
Year                  0
Price                 0
dtype: int64

## Checking for duplicates

In [8]:
df.duplicated().sum()

77

## Removing duplicates

In [9]:
df2= df.drop_duplicates()

In [10]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2563 entries, 0 to 2639
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Name                2563 non-null   object
 1   Transimission_Type  2563 non-null   object
 2   Engine_Size         2563 non-null   object
 3   Usage_Origin        2563 non-null   object
 4   Year                2563 non-null   int64
 5   Price               2563 non-null   object
dtypes: int64(1), object(5)
memory usage: 140.2+ KB

## Data Inconsistency

In [11]:
df2['Transimission_Type'].unique()

array(['Automatic', 'Foreign Used', 'Manual', 'Kenyan Used'], dtype=object)

In [12]:
df2['Engine_Size'].unique()

array(['1500 CC', '2700 CC', '2000 CC', '1300 CC', '1200 CC', '1000 CC',
       '3300 CC', '2500 CC', '4000 CC', '3000 CC', '2400 CC', '180 CC',
       '1600 CC', '3500 CC', ' ', '4600 CC', '2200 CC', '1800 CC',
       '2800 CC', '1400 CC', '6750 CC', '5600 CC', '3600 CC', '2140 CC',
       '4500 CC', '6000 CC', '4400 CC', '660 CC', '5700 CC', '5000 CC',
       '2100 CC', '3200 CC', '2900 CC', '6400 CC', '3800 CC', '3900 CC',
       '5500 CC', '2993 CC', '4200 CC', '2300 CC', '4700 CC', '2143 CC',
       '2018 CC', '2017 CC', '2600 CC', '6200 CC', 'Foreign Used',
       'Kenyan Used', '2148 CC', '750 CC', '900 CC', '2350 CC', '5200 CC',
       '1242 CC', '650 CC', '4300 CC', '2956 CC', '1499 CC'], dtype=object)

In [14]:
df2['Usage_Origin'].unique()

array(['Kenyan Used', 'Foreign Used'], dtype=object)

In [15]:
df2['Year'].unique()

array([2016, 2017, 2004, 2015, 2023, 2013, 2018, 2019, 2021, 2020, 2012,
       2006, 2010, 2014, 2007, 2008, 2022, 2005, 2011, 2001, 1998, 2009,
       1999, 2002, 2000, 2003, 2024, 1986, 1997, 1996, 1990, 1979, 1981,
       1989, 1994, 1995], dtype=int64)

In [16]:
# Check if there are other currencies
other_currencies = df2[~df2['Price'].str.contains('KES')]
other_currencies

,Name,Transimission_Type,Engine_Size,Usage_Origin,Year,Price
2607,Mercedes-Benz E350 D,Automatic,3000 CC,Foreign Used,2017,"£26,052"

## Initial Cleaning

### (i) Transmission types

In [17]:
# Identify rows with 'Foreign Used' values
df2[df2['Transimission_Type'] == 'Foreign Used']

,Name,Transimission_Type,Engine_Size,Usage_Origin,Year,Price
33,Volkswagen Golf R,Foreign Used,,Foreign Used,2018,"KES 4,450,500"
765,Toyota Landcruiser,Foreign Used,,Foreign Used,2017,"KES 10,450,000"

Two rows were found to have inconsistencies hence to be dropped.

In [19]:
df2['Transimission_Type'] = df2['Transimission_Type'].replace('Foreign Used', '')

C:\Users\LAMECK OMENDA\AppData\Local\Temp\ipykernel_6564\859860628.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Transimission_Type'] = df2['Transimission_Type'].replace('Foreign Used', '')

Confirm if indeed they are dropped.

In [56]:
df2['Transimission_Type'] = df2['Transimission_Type'].replace('Kenyan Used', '')

C:\Users\LAMECK OMENDA\AppData\Local\Temp\ipykernel_6564\284507102.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Transimission_Type'] = df2['Transimission_Type'].replace('Kenyan Used', '')

In [57]:
df2[df2['Transimission_Type'] == 'Foreign Used']

Empty DataFrame
Columns: [Name, Transimission_Type, Engine_Size, Usage_Origin, Year, Price, Make, Model, Car_Age, Price_Range]
Index: []

Rows succesfully dropped

### (ii)Engine size

In [21]:
# Drop all characters that are not numeric and convert the column to numeric type
df2['Engine_Size'] = pd.to_numeric(df2['Engine_Size'].str.replace(r'[^0-9.]', '', regex = True), errors = 'coerce')

C:\Users\LAMECK OMENDA\AppData\Local\Temp\ipykernel_6564\1167919739.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Engine_Size'] = pd.to_numeric(df2['Engine_Size'].str.replace(r'[^0-9.]', '', regex = True), errors = 'coerce')

In [22]:
# Confirm if droped
df2['Engine_Size'].unique()

array([1500., 2700., 2000., 1300., 1200., 1000., 3300., 2500., 4000.,
       3000., 2400.,  180., 1600., 3500.,   nan, 4600., 2200., 1800.,
       2800., 1400., 6750., 5600., 3600., 2140., 4500., 6000., 4400.,
        660., 5700., 5000., 2100., 3200., 2900., 6400., 3800., 3900.,
       5500., 2993., 4200., 2300., 4700., 2143., 2018., 2017., 2600.,
       6200., 2148.,  750.,  900., 2350., 5200., 1242.,  650., 4300.,
       2956., 1499.])

### (iii) Price

In [29]:
# Convert the Price column to float type
df2['Price'] = df2['Price'].str.replace(r'[^0-9.]', '', regex = True).astype(float)

C:\Users\LAMECK OMENDA\AppData\Local\Temp\ipykernel_6564\666748023.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Price'] = df2['Price'].str.replace(r'[^0-9.]', '', regex = True).astype(float)

The column Price has been converted to float therefore now convert the price in euros into KES

In [30]:
# Convert the euro price into KES and confirm if converted
df2.at[2412, 'Price'] *= 167.2

In [31]:
# confirm if converted using iloc
df2.iloc[[2412]]

,Name,Transimission_Type,Engine_Size,Usage_Origin,Year,Price
2482,Audi A5 s line,Automatic,2000.0,Kenyan Used,2015,2999999.0

Now the price has been converted to KES

## Summary Statistics

In [32]:
df2.describe()

       Engine_Size         Year         Price
count  2556.000000  2563.000000  2.563000e+03
mean   2276.863067  2015.271557  4.721773e+06
std     911.578906     4.061923  6.840463e+06
min     180.000000  1979.000000  2.605200e+04
25%    1600.000000  2014.000000  1.650000e+06
50%    2000.000000  2016.000000  2.999999e+06
75%    2800.000000  2017.000000  5.199999e+06
max    6750.000000  2024.000000  2.006398e+08

## Feature Engineering

1.The first step is to split the Name column into 'Make' and 'model'.
2.Create a new colum 'Car_Age' based on the colum Year.

### (i) Make & Model

In [34]:
# Split column 'Name' into 'Make' and 'Model'

df2['Name'] = df2['Name'].str.title()
unique_names = ['Alfa Romeo', 'Aston Martin', 'Land Rover', 'Mercedes Benz', 'Rolls Royce', 'Range Rover']

def split_name(Name):
    for unique_name in unique_names:
        if Name.startswith(unique_name):
            Make = unique_name
            Model = Name[len(Make):].strip()
            return Make, Model

    single_name_make = Name.split(' ', 1)
    if len(single_name_make) > 1:
        Make, Model = single_name_make[0], single_name_make[1]
    else:
        Make = Name
        Model = ''
    return Make, Model

df2[['Make', 'Model']] = df2['Name'].apply(lambda x: pd.Series(split_name(x)))

C:\Users\LAMECK OMENDA\AppData\Local\Temp\ipykernel_6564\1817505622.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Name'] = df2['Name'].str.title()
C:\Users\LAMECK OMENDA\AppData\Local\Temp\ipykernel_6564\1817505622.py:21: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2[['Make', 'Model']] = df2['Name'].apply(lambda x: pd.Series(split_name(x)))
C:\Users\LAMECK OMENDA\AppData\Local\Temp\ipykernel_6564\1817505622.py:21: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2[['Make', 'Model']] = df2['Name'].apply(lambda x: pd.Series(split_name(x)))

In [36]:
# Display the first 5 rows
df2.head()

,Name,Transimission_Type,Engine_Size,Usage_Origin,Year,Price,Make,Model
0,Volvo S60,Automatic,1500.0,Kenyan Used,2016,1699999.0,Volvo,S60
1,Toyota Landcruiser Prado,Automatic,2700.0,Kenyan Used,2017,5799999.0,Toyota,Landcruiser Prado
2,Mazda Cx3,Automatic,2000.0,Foreign Used,2017,2499999.0,Mazda,Cx3
3,Toyota Cami,Automatic,1300.0,Kenyan Used,2004,579999.0,Toyota,Cami
4,Bmw X1,Automatic,2000.0,Foreign Used,2017,3799999.0,Bmw,X1

### (ii) Car Age

In [37]:
# Import date
from datetime import date

In [38]:
# Get the current year
date = date.today()
year = date.year

In [41]:
# Get the car age
df2['Car_Age'] = df2['Year'].apply(lambda x: year - x)

C:\Users\LAMECK OMENDA\AppData\Local\Temp\ipykernel_6564\1235383425.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Car_Age'] = df2['Year'].apply(lambda x: year - x)

### (iii) Price Range

In [42]:
def price_range(Price):
    if Price <= 1000000:
        return '0-1M'
    elif Price <= 2000000:
        return '1M-2M'
    elif Price <= 3000000:
        return '2M-3M'
    elif Price <= 5000000:
        return '3M-5M'
    elif Price <= 10000000:
        return '5M-10M'
    elif Price <= 20000000:
        return '10M-20M'
    elif Price <= 30000000:
        return '20M-30M'
    else:
        return 'Above 30M'

df2['Price_Range'] = df2['Price'].apply(lambda x: price_range(x))

C:\Users\LAMECK OMENDA\AppData\Local\Temp\ipykernel_6564\885361781.py:19: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Price_Range'] = df2['Price'].apply(lambda x: price_range(x))

In [43]:
df2.head()

,Name,Transimission_Type,Engine_Size,Usage_Origin,Year,Price,Make,Model,Car_Age,Price_Range
0,Volvo S60,Automatic,1500.0,Kenyan Used,2016,1699999.0,Volvo,S60,8,1M-2M
1,Toyota Landcruiser Prado,Automatic,2700.0,Kenyan Used,2017,5799999.0,Toyota,Landcruiser Prado,7,5M-10M
2,Mazda Cx3,Automatic,2000.0,Foreign Used,2017,2499999.0,Mazda,Cx3,7,2M-3M
3,Toyota Cami,Automatic,1300.0,Kenyan Used,2004,579999.0,Toyota,Cami,20,0-1M
4,Bmw X1,Automatic,2000.0,Foreign Used,2017,3799999.0,Bmw,X1,7,3M-5M

### Final data cleaning

In [45]:
# Check unique values under 'Make' column
make_list = sorted(df2['Make'].unique()) # sort in alphabetic order to identify inconsistency easily.
for make in make_list:
    print(make)
    
print(f'\nlength: {len(make_list)}')

Alfa Romeo
Audi
Bentley
Bmw
Chevrolet
Citreon
Citroen
Citroën
Daihatsu
Dodge
Faw
Ferrari
Ford
Hino
Honda
Hyundai
Isuzu
Jaguar
Jeep
Kia
Lamborghini
Land Rover
Landcruiser
Landrover
Lexus
Mark
Mazda
Mercedes
Mercedes Benz
Mercedes-Benz
Mini
Mistubishi
Mitsubishi
Nissan
Peugeot
Porsche
Range Rover
Renault
Rolls-Royce
Smart
Subaru
Suzuki
Tata
Toyota
Volkswagen
Volvo

length: 46

#### Observation

1.Mercedes and Mercedes-Benz needs to be replaced with Mercedes Benz.
2.Landrover needs to be replaced with Land Rover.
3.I need to prepend Toyota where the name Landcruiser, Passo, and Mark appears under Make.
4.Mistubushi needs to be replaced with Mitsubishi.
5.Citreon and Citroën needs to be replaced with Citroen.

In [46]:
# Replace Landrover with Land Rover
df2['Name'] = df2['Name'].str.replace('Landrover', 'Land Rover')

C:\Users\LAMECK OMENDA\AppData\Local\Temp\ipykernel_6564\2296694120.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Name'] = df2['Name'].str.replace('Landrover', 'Land Rover')

In [47]:
# Replace Citreon and Citroën with Citroen
df2['Name'] = df2['Name'].str.replace(r'Citroën|Citreon', 'Citroen', regex = True)

C:\Users\LAMECK OMENDA\AppData\Local\Temp\ipykernel_6564\60160650.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Name'] = df2['Name'].str.replace(r'Citroën|Citreon', 'Citroen', regex = True)

In [48]:
# Replace Mistubushi with Mitsubishi
df2['Name'] = df2['Name'].str.replace('Mistubishi', 'Mitsubishi')

C:\Users\LAMECK OMENDA\AppData\Local\Temp\ipykernel_6564\3954956124.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Name'] = df2['Name'].str.replace('Mistubishi', 'Mitsubishi')

In [49]:
# Replace Mercedes and Mercedes-Benz with Mercedes Benz.
df2['Name'] = df2['Name'].str.replace(r'(?<!Mercedes\s)Mercedes(-Benz)?', 'Mercedes Benz', regex = True) #Using negative look behind (?<!...)

C:\Users\LAMECK OMENDA\AppData\Local\Temp\ipykernel_6564\990291705.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Name'] = df2['Name'].str.replace(r'(?<!Mercedes\s)Mercedes(-Benz)?', 'Mercedes Benz', regex = True) #Using negative look behind (?<!...)

In [50]:
# Prepend Toyota to Mark, Passoo, and Landcruiser
df2['Name'] = df2['Name'].apply(lambda x: 'Toyota ' + x if ('Landcruiser' in x or 'Mark' in x or 'Passo' in x) and 'Toyota' not in x else x)

C:\Users\LAMECK OMENDA\AppData\Local\Temp\ipykernel_6564\77488915.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['Name'] = df2['Name'].apply(lambda x: 'Toyota ' + x if ('Landcruiser' in x or 'Mark' in x or 'Passo' in x) and 'Toyota' not in x else x)

In [52]:
# Call the splitting function
df2[['Make', 'Model']] = df2['Name'].apply(lambda x: pd.Series(split_name(x)))

# Re-check unique values under 'Make' column
make_list = sorted(df2['Make'].unique())
for make in make_list:
    print(make)
    
print(f'\nlength: {len(make_list)}')

Alfa Romeo
Audi
Bentley
Bmw
Chevrolet
Citroen
Daihatsu
Dodge
Faw
Ferrari
Ford
Hino
Honda
Hyundai
Isuzu
Jaguar
Jeep
Kia
Lamborghini
Land Rover
Lexus
Mazda
Mercedes Benz
Mini
Mitsubishi
Nissan
Peugeot
Porsche
Range Rover
Renault
Rolls-Royce
Smart
Subaru
Suzuki
Tata
Toyota
Volkswagen
Volvo

length: 38

C:\Users\LAMECK OMENDA\AppData\Local\Temp\ipykernel_6564\2016101481.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2[['Make', 'Model']] = df2['Name'].apply(lambda x: pd.Series(split_name(x)))

### Final Statistics

In [54]:
# Display numbers in standard notation
pd.options.display.float_format = '{:.2f}'.format

df2.describe().T

,count,mean,std,min,25%,50%,75%,max
Engine_Size,2556.00,2276.86,911.58,180.00,1600.00,2000.00,2800.00,6750.00
Year,2563.00,2015.27,4.06,1979.00,2014.00,2016.00,2017.00,2024.00
Price,2563.00,4721773.40,6840463.35,26052.00,1650000.00,2999999.00,5199999.00,200639832.80
Car_Age,2563.00,8.73,4.06,0.00,7.00,8.00,10.00,45.00

### Save the final cleaned data

In [59]:
df2.to_csv('final_clean_car_data2.csv', index = False)